[
[3,47,"systemd.mount(5)","systemd.mount — Mount unit configuration","systemd.mount.html"],
[6,1,"Mount"],
[4,1,"Configures a `Requires=` and an `After=` dependency between the created mount unit and another systemd unit, such as a device or mount unit. The argument should be a unit name, or an absolute path to a device node or mount point. This option may be specified more than once. This option is particularly useful for mount point declarations that need an additional device to be around (such as an external journal device for journal file systems) or an additional mount to be in place (such as an overlay file system that merges multiple mount points). See `After=` and `Requires=` in [systemd.unit(5)](systemd.unit.html) for details.\n\nNote that this option always applies to the created mount unit only regardless whether `x-systemd.automount` has been specified.","#x-systemd.requires=",220],
[4,2,"Configures a `Wants=` and an `After=` dependency between the created mount unit and another systemd unit, similar to the `x-systemd.requires=` option.","#x-systemd.wants=",257],
[4,3,"In the created mount unit, configures a `Before=` or `After=` dependency on another systemd unit, such as a mount unit. The argument should be a unit name or an absolute path to a mount point. This option may be specified more than once. This option is particularly useful for mount point declarations with `nofail` option that are mounted asynchronously but need to be mounted before or after some unit start, for example, before `local-fs.target` unit. See `Before=` and `After=` in [systemd.unit(5)](systemd.unit.html) for details.\n\nNote that these options always apply to the created mount unit only regardless whether `x-systemd.automount` has been specified.","#x-systemd.before=",233],
[4,4,"In the created mount unit, configures a `WantedBy=` or `RequiredBy=` dependency on another unit. This option may be specified more than once. If this is specified, the default dependencies (see above) other than `umount.target` on the created mount unit, e.g. `local-fs.target`, are not automatically created. Hence it is likely that some ordering dependencies need to be set up manually through `x-systemd.before=` and `x-systemd.after=`. See `WantedBy=` and `RequiredBy=` in [systemd.unit(5)](systemd.unit.html) for details.","#x-systemd.wanted-by=",245],
[4,5,"Configures a `RequiresMountsFor=` or `WantsMountsFor=` dependency between the created mount unit and other mount units. The argument must be an absolute path. This option may be specified more than once. See `RequiresMountsFor=` or `WantsMountsFor=` in [systemd.unit(5)](systemd.unit.html) for details.","#x-systemd.wants-mounts-for=",220],
[4,6,"Takes a boolean argument. If true or no argument, a `BindsTo=` dependency on the backing device is set. If false, the mount unit is not stopped no matter whether the backing device is still present. This is useful when the file system is backed by volume managers. If not set, and the mount comes from unit fragments, i.e. generated from `/etc/fstab` by [systemd-fstab-generator(8)](systemd-fstab-generator.html) or loaded from a manually configured mount unit, a combination of `Requires=` and `StopPropagatedFrom=` dependencies is set on the backing device, otherwise only `Requires=` is used.","#x-systemd.device-bound=",233],
[4,7,"Configures the idle timeout of the automount unit. See `TimeoutIdleSec=` in [systemd.automount(5)](systemd.automount.html) for details.","#x-systemd.idle-timeout=",220],
[4,8,"Configure how long systemd should wait for a device to show up before giving up on an entry from `/etc/fstab`. Specify a time in seconds or explicitly append a unit such as \"`s`\", \"`min`\", \"`h`\", \"`ms`\".\n\nNote that this option can only be used in `/etc/fstab`, and will be ignored when part of the `Options=` setting in a unit file.","#x-systemd.device-timeout=",215],
[4,9,"Configure how long systemd should wait for the mount command to finish before giving up on an entry from `/etc/fstab`. Specify a time in seconds or explicitly append a unit such as \"`s`\", \"`min`\", \"`h`\", \"`ms`\".\n\nNote that this option can only be used in `/etc/fstab`, and will be ignored when part of the `Options=` setting in a unit file.\n\nSee `TimeoutSec=` below for details.","#x-systemd.mount-timeout=",233],
[4,10,"Takes an absolute path or a fstab-style identifier of a device node, file or other resource to mount. See [mount(8)](https://man7.org/linux/man-pages/man8/mount.8.html) for details. If this refers to a device node, a dependency on the respective device unit is automatically created. (See [systemd.device(5)](systemd.device.html) for more information.) This option is mandatory. Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as \"`%%`\". If this mount is a bind mount and the specified path does not exist yet it is created as directory.","#What=",null],
[4,11,"Takes an absolute path of a file or directory for the mount point; in particular, the destination cannot be a symbolic link. If the mount point does not exist at the time of mounting, it is created as either a directory or a file. The former is the usual case; the latter is done only if this mount is a bind mount and the source (`What=`) is not a directory. This string must be reflected in the unit filename. (See above.) This option is mandatory.","#Where=",null],
[4,12,"Takes a string for the file system type. See [mount(8)](https://man7.org/linux/man-pages/man8/mount.8.html) for details. This setting is optional.\n\nIf the type is \"`overlay`\", and \"`upperdir=`\" or \"`workdir=`\" are specified as options and the directories don't exist, they will be created.","#Type=",null],
[4,13,"Mount options to use when mounting. This takes a comma-separated list of options. This setting is optional. Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as \"`%%`\".","#Options=",null],
[4,14,"Takes a boolean argument. If true, parsing of the options specified in `Options=` is relaxed, and unknown mount options are tolerated. This corresponds with [mount(8)](https://man7.org/linux/man-pages/man8/mount.8.html)'s _`-s`_ switch. Defaults to off.","#SloppyOptions=",215],
[4,15,"Takes a boolean argument. If true, detach the filesystem from the filesystem hierarchy at time of the unmount operation, and clean up all references to the filesystem as soon as they are not busy anymore. This corresponds with [umount(8)](https://man7.org/linux/man-pages/man8/umount.8.html)'s _`-l`_ switch. Defaults to off.","#LazyUnmount=",232],
[4,16,"Takes a boolean argument. If false, a mount point that shall be mounted read-write but cannot be mounted so is retried to be mounted read-only. If true the operation will fail immediately after the read-write mount attempt did not succeed. This corresponds with [mount(8)](https://man7.org/linux/man-pages/man8/mount.8.html)'s _`-w`_ switch. Defaults to off.","#ReadWriteOnly=",246],
[4,17,"Takes a boolean argument. If true, force an unmount (in case of an unreachable NFS system). This corresponds with [umount(8)](https://man7.org/linux/man-pages/man8/umount.8.html)'s _`-f`_ switch. Defaults to off.","#ForceUnmount=",232],
[4,18,"Directories of mount points (and any parent directories) are automatically created if needed. This option specifies the file system access mode used when creating these directories. Takes an access mode in octal notation. Defaults to 0755.","#DirectoryMode=",null],
[4,19,"Configures the time to wait for the mount command to finish. If a command does not exit within the configured time, the mount will be considered failed and be shut down again. All commands still running will be terminated forcibly via `SIGTERM`, and after another delay of this time with `SIGKILL`. (See `KillMode=` in [systemd.kill(5)](systemd.kill.html).) Takes a unit-less value in seconds, or a time span value such as \"5min 20s\". Pass 0 to disable the timeout logic. The default value is set from `DefaultTimeoutStartSec=` option in [systemd-system.conf(5)](systemd-system.conf.html).","#TimeoutSec=",null],
[2,"DirectoryMode",[],18,47,1],
[2,"ForceUnmount","b",17,47,1],
[2,"LazyUnmount","b",15,47,1],
[2,"Options",[],13,47,1],
[2,"ReadWriteOnly","b",16,47,1],
[2,"SloppyOptions","b",14,47,1],
[2,"TimeoutSec",[],19,47,1],
[2,"Type",[],12,47,1],
[2,"What",[],10,47,1],
[2,"Where",[],11,47,1],
[2,"x-systemd.after",[],3,47,null],
[2,"x-systemd.before",[],3,47,null],
[2,"x-systemd.device-bound","b",6,47,null],
[2,"x-systemd.device-timeout",[],8,47,null],
[2,"x-systemd.idle-timeout",[],7,47,null],
[2,"x-systemd.mount-timeout",[],9,47,null],
[2,"x-systemd.required-by",[],4,47,null],
[2,"x-systemd.requires",[],1,47,null],
[2,"x-systemd.requires-mounts-for",[],5,47,null],
[2,"x-systemd.wanted-by",[],4,47,null],
[2,"x-systemd.wants",[],2,47,null],
[2,"x-systemd.wants-mounts-for",[],5,47,null]
]