[
[3,50,"systemd.nspawn(5)","systemd.nspawn — Container settings","systemd.nspawn.html"],
[6,1,"Exec"],
[6,2,"Files"],
[6,3,"Network"],
[4,1,"Takes a boolean argument, which defaults to off. If enabled, **systemd-nspawn** will automatically search for an `init` executable and invoke it. In this case, the specified parameters using `Parameters=` are passed as additional arguments to the `init` process. This setting corresponds to the `--boot` switch on the **systemd-nspawn** command line. This option may not be combined with `ProcessTwo=yes`. This option is specified by default in the `systemd-nspawn@.service` template unit.","#Boot=",226],
[4,2,"Takes a boolean argument, which defaults to off, If enabled, the container is run with a temporary snapshot of its file system that is removed immediately when the container terminates. This is equivalent to the `--ephemeral` command line switch. See [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported.","#Ephemeral=",240],
[4,3,"Takes a boolean argument, which defaults to off. If enabled, the specified program is run as PID 2. A stub init process is run as PID 1. This setting corresponds to the `--as-pid2` switch on the **systemd-nspawn** command line. This option may not be combined with `Boot=yes`.","#ProcessTwo=",229],
[4,4,"Takes a whitespace-separated list of arguments. Single (\"`'`\") and double (\"`\"`\") quotes may be used around arguments with whitespace. This is either a command line, beginning with the binary name to execute, or – if `Boot=` is enabled – the list of arguments to pass to the init process. This setting corresponds to the command line parameters passed on the **systemd-nspawn** command line.\n\nNote: `Boot=no`, `Parameters=a b \"c c\"` is the same as **systemd-nspawn a b \"c c\"**, and `Boot=yes`, `Parameters=b 'c c'` is the same as **systemd-nspawn --boot b 'c c'**.","#Parameters=",226],
[4,5,"Takes an environment variable assignment consisting of key and value, separated by \"`=`\". Sets an environment variable for the main process invoked in the container. This setting may be used multiple times to set multiple environment variables. It corresponds to the `--setenv=` command line switch.","#Environment=",226],
[4,6,"Takes a UNIX user name. Specifies the user name to invoke the main process of the container as. This user must be known in the container's user database. This corresponds to the `--user=` command line switch.","#User=",226],
[4,7,"Selects the working directory for the process invoked in the container. Expects an absolute path in the container's file system namespace. This corresponds to the `--chdir=` command line switch.","#WorkingDirectory=",229],
[4,8,"Selects a directory to pivot to `/` inside the container when starting up. Takes a single path, or a pair of two paths separated by a colon. Both paths must be absolute, and are resolved in the container's file system namespace. This corresponds to the `--pivot-root=` command line switch.","#PivotRoot=",233],
[4,9,"Takes a space-separated list of Linux process capabilities (see [capabilities(7)](https://man7.org/linux/man-pages/man7/capabilities.7.html) for details). The `Capability=` setting specifies additional capabilities to pass on top of the default set of capabilities. The `DropCapability=` setting specifies capabilities to drop from the default set. These settings correspond to the `--capability=` and `--drop-capability=` command line switches. Note that `Capability=` is a privileged setting, and only takes effect in `.nspawn` files in `/etc/systemd/nspawn/` and `/run/system/nspawn/` (see above). On the other hand, `DropCapability=` takes effect in all cases. If the special value \"`all`\" is passed, all capabilities are retained (or dropped).\n\nThese settings change the bounding set of capabilities which also limits the ambient capabilities as given with the `AmbientCapability=`.","#Capability=",226],
[4,10,"Takes a space-separated list of Linux process capabilities (see [capabilities(7)](https://man7.org/linux/man-pages/man7/capabilities.7.html) for details). The `AmbientCapability=` setting specifies capabilities which will be passed to the started program in the inheritable and ambient capability sets. This will grant these capabilities to this process. This setting correspond to the `--ambient-capability=` command line switch.\n\nThe value \"`all`\" is not supported for this setting.\n\nThe setting of `AmbientCapability=` must be covered by the bounding set settings which were established by `Capability=` and `DropCapability=`.\n\nNote that `AmbientCapability=` is a privileged setting (see above).","#AmbientCapability=",248],
[4,11,"Takes a boolean argument that controls the `PR_SET_NO_NEW_PRIVS` flag for the container payload. This is equivalent to the `--no-new-privileges=` command line switch. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#NoNewPrivileges=",239],
[4,12,"Specify the process signal to send to the container's PID 1 when nspawn itself receives SIGTERM, in order to trigger an orderly shutdown of the container. Defaults to SIGRTMIN+3 if `Boot=` is used (on systemd-compatible init systems SIGRTMIN+3 triggers an orderly shutdown). For a list of valid signals, see [signal(7)](https://man7.org/linux/man-pages/man7/signal.7.html).","#KillSignal=",230],
[4,13,"Configures the kernel personality for the container. This is equivalent to the `--personality=` switch.","#Personality=",226],
[4,14,"Configures the 128-bit machine ID (UUID) to pass to the container. This is equivalent to the `--uuid=` command line switch. This option is privileged (see above).","#MachineID=",226],
[4,15,"Configures support for usernamespacing. This is equivalent to the `--private-users=` command line switch, and takes the same options. This option is privileged (see above). This option is the default if the `systemd-nspawn@.service` template unit file is used.","#PrivateUsers=",230],
[4,16,"Configures support for notifications from the container's init process. This is equivalent to the `--notify-ready=` command line switch, and takes the same parameters. See [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported.","#NotifyReady=",231],
[4,17,"Configures the system call filter applied to containers. This is equivalent to the `--system-call-filter=` command line switch, and takes the same list parameter. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#SystemCallFilter=",235],
[4,18,"Configures various types of resource limits applied to containers. This is equivalent to the `--rlimit=` command line switch, and takes the same arguments. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#LimitCPU=",239],
[4,19,"Configures the OOM score adjustment value. This is equivalent to the `--oom-score-adjust=` command line switch, and takes the same argument. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#OOMScoreAdjust=",239],
[4,20,"Configures the CPU affinity. This is equivalent to the `--cpu-affinity=` command line switch, and takes the same argument. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#CPUAffinity=",239],
[4,21,"Configures the kernel hostname set for the container. This is equivalent to the `--hostname=` command line switch, and takes the same argument. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#Hostname=",239],
[4,22,"Configures how `/etc/resolv.conf` in the container shall be handled. This is equivalent to the `--resolv-conf=` command line switch, and takes the same argument. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#ResolvConf=",239],
[4,23,"Configures how `/etc/localtime` in the container shall be handled. This is equivalent to the `--timezone=` command line switch, and takes the same argument. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#Timezone=",239],
[4,24,"Configures how to link host and container journal setups. This is equivalent to the `--link-journal=` command line switch, and takes the same parameter. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#LinkJournal=",239],
[4,25,"Configures whether to suppress disk synchronization for the container payload. This is equivalent to the `--suppress-sync=` command line switch, and takes the same parameter. See [systemd-nspawn(1)](systemd-nspawn.html) for details.","#SuppressSync=",250],
[4,26,"Takes a boolean argument, which defaults to off. If specified, the container will be run with a read-only file system. This setting corresponds to the `--read-only` command line switch.","#ReadOnly=",226],
[4,27,"Takes a boolean argument, or the special value \"`state`\". This configures whether to run the container with volatile state and/or configuration. This option is equivalent to `--volatile=`, see [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported.","#Volatile=",226],
[4,28,"Adds a bind mount from the host into the container. Takes a single path, a pair of two paths separated by a colon, or a triplet of two paths plus an option string separated by colons. This option may be used multiple times to configure multiple bind mounts. This option is equivalent to the command line switches `--bind=` and `--bind-ro=`, see [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported. This setting is privileged (see above).","#Bind=",226],
[4,29,"Binds a user from the host into the container. This option is equivalent to the command line switch `--bind-user=`, see [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported. This setting is privileged (see above).","#BindUser=",249],
[4,30,"Adds a \"`tmpfs`\" mount to the container. Takes a path or a pair of path and option string, separated by a colon. This option may be used multiple times to configure multiple \"`tmpfs`\" mounts. This option is equivalent to the command line switch `--tmpfs=`, see [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported. This setting is privileged (see above).","#TemporaryFileSystem=",226],
[4,31,"Masks the specified file or directory in the container, by over-mounting it with an empty file node of the same type with the most restrictive access mode. Takes a file system path as argument. This option may be used multiple times to mask multiple files or directories. This option is equivalent to the command line switch `--inaccessible=`, see [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported. This setting is privileged (see above).","#Inaccessible=",242],
[4,32,"Adds an overlay mount point. Takes a colon-separated list of paths. This option may be used multiple times to configure multiple overlay mounts. This option is equivalent to the command line switches `--overlay=` and `--overlay-ro=`, see [systemd-nspawn(1)](systemd-nspawn.html) for details about the specific options supported. This setting is privileged (see above).","#Overlay=",233],
[4,33,"Configures whether the ownership of the files and directories in the container tree shall be adjusted to the UID/GID range used, if necessary and user namespacing is enabled. This is equivalent to the `--private-users-ownership=` command line switch. This option is privileged (see above).","#PrivateUsersOwnership=",249],
[4,34,"Takes a boolean argument, which defaults to off. If enabled, the container will run in its own network namespace and not share network interfaces and configuration with the host. This setting corresponds to the `--private-network` command line switch.","#Private=",226],
[4,35,"Takes a boolean argument. Configures whether to create a virtual Ethernet connection (\"`veth`\") between host and the container. This setting implies `Private=yes`. This setting corresponds to the `--network-veth` command line switch. This option is privileged (see above). This option is the default if the `systemd-nspawn@.service` template unit file is used.","#VirtualEthernet=",226],
[4,36,"Takes a colon-separated pair of interface names. Configures an additional virtual Ethernet connection (\"`veth`\") between host and the container. The first specified name is the interface name on the host, the second the interface name in the container. The latter may be omitted in which case it is set to the same name as the host side interface. This setting implies `Private=yes`. This setting corresponds to the `--network-veth-extra=` command line switch, and may be used multiple times. It is independent of `VirtualEthernet=`. Note that this option is unrelated to the `Bridge=` setting below, and thus any connections created this way are not automatically added to any bridge device on the host side. This option is privileged (see above).","#VirtualEthernetExtra=",228],
[4,37,"Takes a space-separated list of interfaces to add to the container. The interface object is defined either by a single interface name, referencing the name on the host, or a colon-separated pair of interfaces, in which case the first one references the name on the host, and the second one the name in the container. This option corresponds to the `--network-interface=` command line switch and implies `Private=yes`. This option is privileged (see above).","#Interface=",226],
[4,38,"Takes a space-separated list of interfaces to add MACLVAN or IPVLAN interfaces to, which are then added to the container. The interface object is defined either by a single interface name, referencing the name on the host, or a colon-separated pair of interfaces, in which case the first one references the name on the host, and the second one the name in the container. These options correspond to the `--network-macvlan=` and `--network-ipvlan=` command line switches and imply `Private=yes`. These options are privileged (see above).","#MACVLAN=",226],
[4,39,"Takes an interface name. This setting implies `VirtualEthernet=yes` and `Private=yes` and has the effect that the host side of the created virtual Ethernet link is connected to the specified bridge interface. This option corresponds to the `--network-bridge=` command line switch. This option is privileged (see above).","#Bridge=",226],
[4,40,"Takes a network zone name. This setting implies `VirtualEthernet=yes` and `Private=yes` and has the effect that the host side of the created virtual Ethernet link is connected to an automatically managed bridge interface named after the passed argument, prefixed with \"`vz-`\". This option corresponds to the `--network-zone=` command line switch. This option is privileged (see above).","#Zone=",230],
[4,41,"Exposes a TCP or UDP port of the container on the host. This option corresponds to the `--port=` command line switch, see [systemd-nspawn(1)](systemd-nspawn.html) for the precise syntax of the argument this option takes. This option is privileged (see above).","#Port=",226],
[2,"AmbientCapability",[],10,50,1],
[2,"Bind",[],28,50,2],
[2,"BindReadOnly",[],28,50,2],
[2,"BindUser",[],29,50,2],
[2,"Boot","b",1,50,1],
[2,"Bridge",[],39,50,3],
[2,"CPUAffinity",[],20,50,1],
[2,"Capability",[],9,50,1],
[2,"DropCapability",[],9,50,1],
[2,"Environment",[],5,50,1],
[2,"Ephemeral","b",2,50,1],
[2,"Hostname",[],21,50,1],
[2,"IPVLAN",[],38,50,3],
[2,"Inaccessible",[],31,50,2],
[2,"Interface",[],37,50,3],
[2,"KillSignal",[],12,50,1],
[2,"LimitAS",[],18,50,1],
[2,"LimitCORE",[],18,50,1],
[2,"LimitCPU",[],18,50,1],
[2,"LimitDATA",[],18,50,1],
[2,"LimitFSIZE",[],18,50,1],
[2,"LimitLOCKS",[],18,50,1],
[2,"LimitMEMLOCK",[],18,50,1],
[2,"LimitMSGQUEUE",[],18,50,1],
[2,"LimitNICE",[],18,50,1],
[2,"LimitNOFILE",[],18,50,1],
[2,"LimitNPROC",[],18,50,1],
[2,"LimitRSS",[],18,50,1],
[2,"LimitRTPRIO",[],18,50,1],
[2,"LimitRTTIME",[],18,50,1],
[2,"LimitSIGPENDING",[],18,50,1],
[2,"LimitSTACK",[],18,50,1],
[2,"LinkJournal",[],24,50,1],
[2,"MACVLAN",[],38,50,3],
[2,"MachineID",[],14,50,1],
[2,"NoNewPrivileges","b",11,50,1],
[2,"NotifyReady",[],16,50,1],
[2,"OOMScoreAdjust",[],19,50,1],
[2,"Overlay",[],32,50,2],
[2,"OverlayReadOnly",[],32,50,2],
[2,"Parameters",[],4,50,1],
[2,"Personality",[],13,50,1],
[2,"PivotRoot",[],8,50,1],
[2,"Port",[],41,50,3],
[2,"Private","b",34,50,3],
[2,"PrivateUsers",[],15,50,1],
[2,"PrivateUsersOwnership",[],33,50,2],
[2,"ProcessTwo","b",3,50,1],
[2,"ReadOnly","b",26,50,2],
[2,"ResolvConf",[],22,50,1],
[2,"SuppressSync",[],25,50,1],
[2,"SystemCallFilter",[],17,50,1],
[2,"TemporaryFileSystem",[],30,50,2],
[2,"Timezone",[],23,50,1],
[2,"User",[],6,50,1],
[2,"VirtualEthernet","b",35,50,3],
[2,"VirtualEthernetExtra",[],36,50,3],
[2,"Volatile","b",27,50,2],
[2,"WorkingDirectory",[],7,50,1],
[2,"Zone",[],40,50,3]
]