[
[3,11,"systemd.scope(5)","systemd.scope — Scope unit configuration","systemd.scope.html"],
[6,1,"Scope"],
[4,1,"Configure the out-of-memory (OOM) killing policy for the kernel and the userspace OOM killer [systemd-oomd.service(8)](systemd-oomd.service.html). On Linux, when memory becomes scarce to the point that the kernel has trouble allocating memory for itself, it might decide to kill a running process in order to free up memory and reduce memory pressure. Note that `systemd-oomd.service` is a more flexible solution that aims to prevent out-of-memory situations for the userspace too, not just the kernel, by attempting to terminate services earlier, before the kernel would have to act.\n\nThis setting takes one of `continue`, `stop` or `kill`. If set to `continue` and a process in the unit is killed by the OOM killer, this is logged but the unit continues running. If set to `stop` the event is logged but the unit is terminated cleanly by the service manager. If set to `kill` and one of the unit's processes is killed by the OOM killer the kernel is instructed to kill all remaining processes of the unit too, by setting the `memory.oom.group` attribute to `1`; also see kernel page [Control Group v2](https://docs.kernel.org/admin-guide/cgroup-v2.html).\n\nDefaults to the setting `DefaultOOMPolicy=` in [systemd-system.conf(5)](systemd-system.conf.html) is set to, except for units where `Delegate=` is turned on, where it defaults to `continue`.\n\nUse the `OOMScoreAdjust=` setting to configure whether processes of the unit shall be considered preferred or less preferred candidates for process termination by the Linux OOM killer logic. See [systemd.exec(5)](systemd.exec.html) for details.\n\nThis setting also applies to [systemd-oomd.service(8)](systemd-oomd.service.html). Similarly to the kernel OOM kills performed by the kernel, this setting determines the state of the unit after **systemd-oomd** kills a cgroup associated with it.\n\nAdded in version 243.","#OOMPolicy="],
[4,2,"Configures a maximum time for the scope to run. If this is used and the scope has been active for longer than the specified time it is terminated and put into a failure state. Pass \"`infinity`\" (the default) to configure no runtime limit.\n\nAdded in version 244.","#RuntimeMaxSec="],
[4,3,"This option modifies `RuntimeMaxSec=` by increasing the maximum runtime by an evenly distributed duration between 0 and the specified value (in seconds). If `RuntimeMaxSec=` is unspecified, then this feature will be disabled.\n\nAdded in version 250.","#RuntimeRandomizedExtraSec="],
[2,"OOMPolicy","",1,11,1],
[2,"RuntimeMaxSec","",2,11,1],
[2,"RuntimeRandomizedExtraSec","",3,11,1]
]