[
[3,12,"systemd.swap(5)","systemd.swap — Swap unit configuration","systemd.swap.html"],
[6,1,"Swap"],
[4,1,"Configure how long systemd should wait for a device to show up before giving up on an entry from `/etc/fstab`. Specify a time in seconds or explicitly append a unit such as \"`s`\", \"`min`\", \"`h`\", \"`ms`\".\n\nNote that this option can only be used in `/etc/fstab`, and will be ignored when part of the `Options=` setting in a unit file.","#x-systemd.device-timeout=",215],
[4,2,"Takes an absolute path of a device node or file to use for paging. See [swapon(8)](https://man7.org/linux/man-pages/man8/swapon.8.html) for details. If this refers to a device node, a dependency on the respective device unit is automatically created. (See [systemd.device(5)](systemd.device.html) for more information.) If this refers to a file, a dependency on the respective mount unit is automatically created. (See [systemd.mount(5)](systemd.mount.html) for more information.) This option is mandatory. Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as \"`%%`\".","#What=",null],
[4,3,"Swap priority to use when activating the swap device or file. This takes an integer. This setting is optional and ignored when the priority is set by `pri=` in the `Options=` key.","#Priority=",null],
[4,4,"May contain an option string for the swap device. This may be used for controlling discard options among other functionality, if the swap backing device supports the discard or trim operation. (See [swapon(8)](https://man7.org/linux/man-pages/man8/swapon.8.html) for more information.) Note that the usual specifier expansion is applied to this setting, literal percent characters should hence be written as \"`%%`\".","#Options=",217],
[4,5,"Configures the time to wait for the swapon command to finish. If a command does not exit within the configured time, the swap will be considered failed and be shut down again. All commands still running will be terminated forcibly via `SIGTERM`, and after another delay of this time with `SIGKILL`. (See `KillMode=` in [systemd.kill(5)](systemd.kill.html).) Takes a unit-less value in seconds, or a time span value such as \"5min 20s\". Pass \"`0`\" to disable the timeout logic. Defaults to `DefaultTimeoutStartSec=` from the manager configuration file (see [systemd-system.conf(5)](systemd-system.conf.html)).","#TimeoutSec=",null],
[2,"Options",[],4,12,1],
[2,"Priority",[],3,12,1],
[2,"TimeoutSec",[],5,12,1],
[2,"What",[],2,12,1],
[2,"x-systemd.device-timeout",[],1,12,null]
]