[
[3,41,"timesyncd.conf(5)","timesyncd.conf, timesyncd.conf.d — Network Time Synchronization configuration files","timesyncd.conf.html"],
[6,1,"Time"],
[4,1,"A space-separated list of NTP server host names or IP addresses. During runtime this list is combined with any per-interface NTP servers acquired from [systemd-networkd.service(8)](systemd-networkd.service.html). **systemd-timesyncd** will contact all configured system or per-interface servers in turn, until one responds. When the empty string is assigned, the list of NTP servers is reset, and all prior assignments will have no effect. This setting defaults to an empty list.\n\nAdded in version 216.","#NTP="],
[4,2,"A space-separated list of NTP server host names or IP addresses to be used as the fallback NTP servers. Any per-interface NTP servers obtained from [systemd-networkd.service(8)](systemd-networkd.service.html) take precedence over this setting, as do any servers set via `NTP=` above. This setting is hence only relevant if no other NTP server information is known. When the empty string is assigned, the list of NTP servers is reset, and all prior assignments will have no effect. If this option is not given, a compiled-in list of NTP servers is used.\n\nAdded in version 216.","#FallbackNTP="],
[4,3,"Maximum acceptable root distance, i.e. the maximum estimated time required for a packet to travel to the server we are connected to from the server with the reference clock. If the current server does not satisfy this limit, **systemd-timesyncd** will switch to a different server.\n\nTakes a time span value. The default unit is seconds, but other units may be specified, see [systemd.time(5)](systemd.time.html). Defaults to 5 seconds.\n\nAdded in version 236.","#RootDistanceMaxSec="],
[4,4,"The minimum and maximum poll intervals for NTP messages. Polling starts at the minimum poll interval, and is adjusted within the specified limits in response to received packets.\n\nEach setting takes a time span value. The default unit is seconds, but other units may be specified, see [systemd.time(5)](systemd.time.html). `PollIntervalMinSec=` defaults to 32 seconds and must not be smaller than 16 seconds. `PollIntervalMaxSec=` defaults to 34 min 8 s (2048 seconds) and must be larger than `PollIntervalMinSec=`.\n\nAdded in version 236.","#PollIntervalMinSec="],
[4,5,"Specifies the minimum delay before subsequent attempts to contact a new NTP server are made.\n\nTakes a time span value. The default unit is seconds, but other units may be specified, see [systemd.time(5)](systemd.time.html). Defaults to 30 seconds and must not be smaller than 1 second.\n\nAdded in version 248.","#ConnectionRetrySec="],
[4,6,"The interval at which the current time is periodically saved to disk, in the absence of any recent synchronisation from an NTP server. This is especially useful for offline systems with no local RTC, as it will guarantee that the system clock remains roughly monotonic across reboots.\n\nTakes a time interval value. The default unit is seconds, but other units may be specified, see [systemd.time(5)](systemd.time.html). Defaults to 60 seconds.\n\nAdded in version 250.","#SaveIntervalSec="],
[2,"ConnectionRetrySec","",5,41,1],
[2,"FallbackNTP","",2,41,1],
[2,"NTP","",1,41,1],
[2,"PollIntervalMaxSec","",4,41,1],
[2,"PollIntervalMinSec","",4,41,1],
[2,"RootDistanceMaxSec","",3,41,1],
[2,"SaveIntervalSec","",6,41,1]
]